###############################################################################
# Created by write_sdc
# Sat Apr 29 00:52:16 2023
###############################################################################
current_design fpga_core
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name prog_clk -period 999999.9375 [get_ports {prog_clk}]
set_clock_transition 0.5000 [get_clocks {prog_clk}]
set_clock_uncertainty 0.2500 prog_clk
set_propagated_clock [get_clocks {prog_clk}]
create_clock -name clk -period 999999.9375 [get_ports {clk}]
set_clock_transition 0.5000 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.1200 [get_ports {ccff_tail}]
set_load -pin_load 0.1200 [get_ports {sc_tail}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[0]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[1]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[2]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[3]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[4]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[5]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[6]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[7]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[8]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[9]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[10]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[11]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[12]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[13]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[14]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[15]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[16]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[17]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[18]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[19]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[20]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[21]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[22]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[23]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[24]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[25]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[26]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[27]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[28]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[29]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[30]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[31]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[32]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[33]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[34]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[35]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[36]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[37]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[38]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[39]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[40]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[41]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[42]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[43]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[44]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[45]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[46]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[47]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[48]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[49]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[50]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[51]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[52]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[53]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[54]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[55]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[56]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[57]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[58]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[59]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[60]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[61]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[62]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[63]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[64]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[65]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[66]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[67]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[68]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[69]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[70]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[71]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[72]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[73]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[74]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[75]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[76]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[77]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[78]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[79]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[80]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[81]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[82]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[83]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[84]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[85]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[86]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[87]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[88]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[89]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[90]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[91]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[92]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[93]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[94]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[95]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[96]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[97]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[98]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[99]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[100]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[101]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[102]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[103]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[104]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[105]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[106]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[107]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[108]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[109]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[110]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[111]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[112]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[113]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[114]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[115]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[116]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[117]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[118]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[119]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[120]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[121]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[122]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[123]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[124]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[125]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[126]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_dir[127]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[0]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[1]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[2]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[3]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[4]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[5]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[6]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[7]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[8]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[9]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[10]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[11]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[12]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[13]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[14]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[15]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[16]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[17]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[18]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[19]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[20]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[21]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[22]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[23]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[24]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[25]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[26]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[27]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[28]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[29]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[30]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[31]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[32]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[33]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[34]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[35]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[36]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[37]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[38]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[39]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[40]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[41]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[42]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[43]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[44]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[45]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[46]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[47]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[48]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[49]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[50]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[51]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[52]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[53]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[54]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[55]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[56]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[57]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[58]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[59]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[60]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[61]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[62]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[63]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[64]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[65]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[66]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[67]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[68]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[69]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[70]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[71]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[72]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[73]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[74]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[75]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[76]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[77]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[78]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[79]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[80]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[81]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[82]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[83]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[84]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[85]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[86]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[87]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[88]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[89]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[90]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[91]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[92]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[93]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[94]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[95]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[96]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[97]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[98]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[99]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[100]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[101]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[102]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[103]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[104]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[105]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[106]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[107]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[108]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[109]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[110]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[111]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[112]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[113]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[114]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[115]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[116]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[117]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[118]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[119]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[120]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[121]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[122]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[123]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[124]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[125]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[126]}]
set_load -pin_load 0.1200 [get_ports {gfpga_pad_io_soc_out[127]}]
set_input_transition 0.5000 [get_ports {ccff_head}]
set_input_transition 0.5000 [get_ports {clk}]
set_input_transition 0.5000 [get_ports {isol_n}]
set_input_transition 0.5000 [get_ports {prog_clk}]
set_input_transition 0.5000 [get_ports {prog_reset}]
set_input_transition 0.5000 [get_ports {reset}]
set_input_transition 0.5000 [get_ports {sc_head}]
set_input_transition 0.5000 [get_ports {test_enable}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[0]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[1]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[2]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[3]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[4]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[5]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[6]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[7]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[8]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[9]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[10]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[11]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[12]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[13]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[14]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[15]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[16]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[17]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[18]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[19]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[20]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[21]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[22]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[23]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[24]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[25]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[26]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[27]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[28]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[29]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[30]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[31]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[32]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[33]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[34]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[35]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[36]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[37]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[38]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[39]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[40]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[41]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[42]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[43]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[44]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[45]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[46]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[47]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[48]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[49]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[50]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[51]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[52]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[53]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[54]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[55]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[56]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[57]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[58]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[59]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[60]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[61]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[62]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[63]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[64]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[65]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[66]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[67]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[68]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[69]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[70]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[71]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[72]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[73]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[74]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[75]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[76]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[77]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[78]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[79]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[80]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[81]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[82]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[83]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[84]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[85]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[86]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[87]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[88]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[89]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[90]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[91]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[92]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[93]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[94]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[95]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[96]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[97]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[98]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[99]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[100]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[101]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[102]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[103]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[104]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[105]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[106]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[107]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[108]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[109]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[110]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[111]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[112]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[113]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[114]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[115]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[116]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[117]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[118]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[119]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[120]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[121]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[122]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[123]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[124]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[125]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[126]}]
set_input_transition 0.5000 [get_ports {gfpga_pad_io_soc_in[127]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
