###############################################################################
# Created by write_sdc
# Mon Jul  4 22:23:44 2022
###############################################################################
current_design grid_clb
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name prog_clk_0_N_in -period 10.0000 [get_ports {prog_clk_0_N_in}]
set_clock_transition 0.1500 [get_clocks {prog_clk_0_N_in}]
set_clock_uncertainty 0.2500 prog_clk_0_N_in
set_propagated_clock [get_clocks {prog_clk_0_N_in}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {SC_IN_TOP}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {Test_en_E_in}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {Test_en_W_in}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {ccff_head}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {clk_0_N_in}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {clk_0_S_in}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {prog_clk_0_S_in}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {right_width_0_height_0__pin_16_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {right_width_0_height_0__pin_17_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {right_width_0_height_0__pin_18_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {right_width_0_height_0__pin_19_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {right_width_0_height_0__pin_20_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {right_width_0_height_0__pin_21_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {right_width_0_height_0__pin_22_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {right_width_0_height_0__pin_23_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {right_width_0_height_0__pin_24_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {right_width_0_height_0__pin_25_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {right_width_0_height_0__pin_26_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {right_width_0_height_0__pin_27_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {right_width_0_height_0__pin_28_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {right_width_0_height_0__pin_29_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {right_width_0_height_0__pin_30_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {right_width_0_height_0__pin_31_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_width_0_height_0__pin_0_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_width_0_height_0__pin_10_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_width_0_height_0__pin_11_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_width_0_height_0__pin_12_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_width_0_height_0__pin_13_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_width_0_height_0__pin_14_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_width_0_height_0__pin_15_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_width_0_height_0__pin_1_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_width_0_height_0__pin_2_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_width_0_height_0__pin_32_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_width_0_height_0__pin_33_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_width_0_height_0__pin_3_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_width_0_height_0__pin_4_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_width_0_height_0__pin_5_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_width_0_height_0__pin_6_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_width_0_height_0__pin_7_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_width_0_height_0__pin_8_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_width_0_height_0__pin_9_}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {SC_OUT_BOT}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {SC_OUT_TOP}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {Test_en_E_out}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {Test_en_W_out}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {bottom_width_0_height_0__pin_50_}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {bottom_width_0_height_0__pin_51_}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {ccff_tail}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {prog_clk_0_E_out}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {prog_clk_0_N_out}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {prog_clk_0_S_out}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {prog_clk_0_W_out}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {right_width_0_height_0__pin_42_lower}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {right_width_0_height_0__pin_42_upper}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {right_width_0_height_0__pin_43_lower}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {right_width_0_height_0__pin_43_upper}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {right_width_0_height_0__pin_44_lower}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {right_width_0_height_0__pin_44_upper}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {right_width_0_height_0__pin_45_lower}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {right_width_0_height_0__pin_45_upper}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {right_width_0_height_0__pin_46_lower}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {right_width_0_height_0__pin_46_upper}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {right_width_0_height_0__pin_47_lower}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {right_width_0_height_0__pin_47_upper}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {right_width_0_height_0__pin_48_lower}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {right_width_0_height_0__pin_48_upper}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {right_width_0_height_0__pin_49_lower}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {right_width_0_height_0__pin_49_upper}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_width_0_height_0__pin_34_lower}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_width_0_height_0__pin_34_upper}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_width_0_height_0__pin_35_lower}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_width_0_height_0__pin_35_upper}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_width_0_height_0__pin_36_lower}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_width_0_height_0__pin_36_upper}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_width_0_height_0__pin_37_lower}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_width_0_height_0__pin_37_upper}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_width_0_height_0__pin_38_lower}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_width_0_height_0__pin_38_upper}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_width_0_height_0__pin_39_lower}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_width_0_height_0__pin_39_upper}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_width_0_height_0__pin_40_lower}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_width_0_height_0__pin_40_upper}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_width_0_height_0__pin_41_lower}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_width_0_height_0__pin_41_upper}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {SC_OUT_BOT}]
set_load -pin_load 0.0334 [get_ports {SC_OUT_TOP}]
set_load -pin_load 0.0334 [get_ports {Test_en_E_out}]
set_load -pin_load 0.0334 [get_ports {Test_en_W_out}]
set_load -pin_load 0.0334 [get_ports {bottom_width_0_height_0__pin_50_}]
set_load -pin_load 0.0334 [get_ports {bottom_width_0_height_0__pin_51_}]
set_load -pin_load 0.0334 [get_ports {ccff_tail}]
set_load -pin_load 0.0334 [get_ports {prog_clk_0_E_out}]
set_load -pin_load 0.0334 [get_ports {prog_clk_0_N_out}]
set_load -pin_load 0.0334 [get_ports {prog_clk_0_S_out}]
set_load -pin_load 0.0334 [get_ports {prog_clk_0_W_out}]
set_load -pin_load 0.0334 [get_ports {right_width_0_height_0__pin_42_lower}]
set_load -pin_load 0.0334 [get_ports {right_width_0_height_0__pin_42_upper}]
set_load -pin_load 0.0334 [get_ports {right_width_0_height_0__pin_43_lower}]
set_load -pin_load 0.0334 [get_ports {right_width_0_height_0__pin_43_upper}]
set_load -pin_load 0.0334 [get_ports {right_width_0_height_0__pin_44_lower}]
set_load -pin_load 0.0334 [get_ports {right_width_0_height_0__pin_44_upper}]
set_load -pin_load 0.0334 [get_ports {right_width_0_height_0__pin_45_lower}]
set_load -pin_load 0.0334 [get_ports {right_width_0_height_0__pin_45_upper}]
set_load -pin_load 0.0334 [get_ports {right_width_0_height_0__pin_46_lower}]
set_load -pin_load 0.0334 [get_ports {right_width_0_height_0__pin_46_upper}]
set_load -pin_load 0.0334 [get_ports {right_width_0_height_0__pin_47_lower}]
set_load -pin_load 0.0334 [get_ports {right_width_0_height_0__pin_47_upper}]
set_load -pin_load 0.0334 [get_ports {right_width_0_height_0__pin_48_lower}]
set_load -pin_load 0.0334 [get_ports {right_width_0_height_0__pin_48_upper}]
set_load -pin_load 0.0334 [get_ports {right_width_0_height_0__pin_49_lower}]
set_load -pin_load 0.0334 [get_ports {right_width_0_height_0__pin_49_upper}]
set_load -pin_load 0.0334 [get_ports {top_width_0_height_0__pin_34_lower}]
set_load -pin_load 0.0334 [get_ports {top_width_0_height_0__pin_34_upper}]
set_load -pin_load 0.0334 [get_ports {top_width_0_height_0__pin_35_lower}]
set_load -pin_load 0.0334 [get_ports {top_width_0_height_0__pin_35_upper}]
set_load -pin_load 0.0334 [get_ports {top_width_0_height_0__pin_36_lower}]
set_load -pin_load 0.0334 [get_ports {top_width_0_height_0__pin_36_upper}]
set_load -pin_load 0.0334 [get_ports {top_width_0_height_0__pin_37_lower}]
set_load -pin_load 0.0334 [get_ports {top_width_0_height_0__pin_37_upper}]
set_load -pin_load 0.0334 [get_ports {top_width_0_height_0__pin_38_lower}]
set_load -pin_load 0.0334 [get_ports {top_width_0_height_0__pin_38_upper}]
set_load -pin_load 0.0334 [get_ports {top_width_0_height_0__pin_39_lower}]
set_load -pin_load 0.0334 [get_ports {top_width_0_height_0__pin_39_upper}]
set_load -pin_load 0.0334 [get_ports {top_width_0_height_0__pin_40_lower}]
set_load -pin_load 0.0334 [get_ports {top_width_0_height_0__pin_40_upper}]
set_load -pin_load 0.0334 [get_ports {top_width_0_height_0__pin_41_lower}]
set_load -pin_load 0.0334 [get_ports {top_width_0_height_0__pin_41_upper}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SC_IN_TOP}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Test_en_E_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Test_en_W_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ccff_head}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk_0_N_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk_0_S_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {prog_clk_0_N_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {prog_clk_0_S_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {right_width_0_height_0__pin_16_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {right_width_0_height_0__pin_17_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {right_width_0_height_0__pin_18_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {right_width_0_height_0__pin_19_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {right_width_0_height_0__pin_20_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {right_width_0_height_0__pin_21_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {right_width_0_height_0__pin_22_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {right_width_0_height_0__pin_23_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {right_width_0_height_0__pin_24_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {right_width_0_height_0__pin_25_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {right_width_0_height_0__pin_26_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {right_width_0_height_0__pin_27_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {right_width_0_height_0__pin_28_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {right_width_0_height_0__pin_29_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {right_width_0_height_0__pin_30_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {right_width_0_height_0__pin_31_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {top_width_0_height_0__pin_0_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {top_width_0_height_0__pin_10_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {top_width_0_height_0__pin_11_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {top_width_0_height_0__pin_12_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {top_width_0_height_0__pin_13_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {top_width_0_height_0__pin_14_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {top_width_0_height_0__pin_15_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {top_width_0_height_0__pin_1_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {top_width_0_height_0__pin_2_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {top_width_0_height_0__pin_32_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {top_width_0_height_0__pin_33_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {top_width_0_height_0__pin_3_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {top_width_0_height_0__pin_4_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {top_width_0_height_0__pin_5_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {top_width_0_height_0__pin_6_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {top_width_0_height_0__pin_7_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {top_width_0_height_0__pin_8_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {top_width_0_height_0__pin_9_}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
