###############################################################################
# Created by write_sdc
# Mon Jul  4 14:03:38 2022
###############################################################################
current_design sb_1__2_
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name prog_clk_0_S_in -period 10.0000 [get_ports {prog_clk_0_S_in}]
set_clock_transition 0.1500 [get_clocks {prog_clk_0_S_in}]
set_clock_uncertainty 0.2500 prog_clk_0_S_in
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {SC_IN_BOT}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {bottom_left_grid_pin_42_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {bottom_left_grid_pin_43_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {bottom_left_grid_pin_44_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {bottom_left_grid_pin_45_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {bottom_left_grid_pin_46_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {bottom_left_grid_pin_47_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {bottom_left_grid_pin_48_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {bottom_left_grid_pin_49_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {ccff_head}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_in[0]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_in[10]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_in[11]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_in[12]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_in[13]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_in[14]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_in[15]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_in[16]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_in[17]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_in[18]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_in[19]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_in[1]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_in[2]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_in[3]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_in[4]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_in[5]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_in[6]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_in[7]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_in[8]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_in[9]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_in[0]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_in[10]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_in[11]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_in[12]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_in[13]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_in[14]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_in[15]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_in[16]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_in[17]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_in[18]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_in[19]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_in[1]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_in[2]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_in[3]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_in[4]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_in[5]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_in[6]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_in[7]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_in[8]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_in[9]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_in[0]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_in[10]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_in[11]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_in[12]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_in[13]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_in[14]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_in[15]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_in[16]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_in[17]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_in[18]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_in[19]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_in[1]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_in[2]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_in[3]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_in[4]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_in[5]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_in[6]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_in[7]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_in[8]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_in[9]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {left_bottom_grid_pin_34_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {left_bottom_grid_pin_35_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {left_bottom_grid_pin_36_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {left_bottom_grid_pin_37_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {left_bottom_grid_pin_38_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {left_bottom_grid_pin_39_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {left_bottom_grid_pin_40_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {left_bottom_grid_pin_41_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {left_top_grid_pin_1_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {right_bottom_grid_pin_34_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {right_bottom_grid_pin_35_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {right_bottom_grid_pin_36_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {right_bottom_grid_pin_37_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {right_bottom_grid_pin_38_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {right_bottom_grid_pin_39_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {right_bottom_grid_pin_40_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {right_bottom_grid_pin_41_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {right_top_grid_pin_1_}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {SC_OUT_BOT}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {ccff_tail}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_out[0]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_out[10]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_out[11]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_out[12]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_out[13]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_out[14]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_out[15]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_out[16]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_out[17]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_out[18]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_out[19]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_out[1]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_out[2]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_out[3]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_out[4]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_out[5]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_out[6]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_out[7]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_out[8]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_left_out[9]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_out[0]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_out[10]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_out[11]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_out[12]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_out[13]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_out[14]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_out[15]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_out[16]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_out[17]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_out[18]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_out[19]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_out[1]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_out[2]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_out[3]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_out[4]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_out[5]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_out[6]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_out[7]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_out[8]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chanx_right_out[9]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_out[0]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_out[10]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_out[11]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_out[12]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_out[13]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_out[14]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_out[15]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_out[16]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_out[17]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_out[18]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_out[19]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_out[1]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_out[2]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_out[3]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_out[4]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_out[5]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_out[6]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_out[7]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_out[8]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_S_in}] -add_delay [get_ports {chany_bottom_out[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {SC_OUT_BOT}]
set_load -pin_load 0.0334 [get_ports {ccff_tail}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[19]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[18]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[17]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[16]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[15]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[14]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[13]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[12]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[11]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[10]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[9]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[8]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[7]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[6]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[5]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[4]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[3]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[2]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[1]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[0]}]
set_load -pin_load 0.0334 [get_ports {chanx_right_out[19]}]
set_load -pin_load 0.0334 [get_ports {chanx_right_out[18]}]
set_load -pin_load 0.0334 [get_ports {chanx_right_out[17]}]
set_load -pin_load 0.0334 [get_ports {chanx_right_out[16]}]
set_load -pin_load 0.0334 [get_ports {chanx_right_out[15]}]
set_load -pin_load 0.0334 [get_ports {chanx_right_out[14]}]
set_load -pin_load 0.0334 [get_ports {chanx_right_out[13]}]
set_load -pin_load 0.0334 [get_ports {chanx_right_out[12]}]
set_load -pin_load 0.0334 [get_ports {chanx_right_out[11]}]
set_load -pin_load 0.0334 [get_ports {chanx_right_out[10]}]
set_load -pin_load 0.0334 [get_ports {chanx_right_out[9]}]
set_load -pin_load 0.0334 [get_ports {chanx_right_out[8]}]
set_load -pin_load 0.0334 [get_ports {chanx_right_out[7]}]
set_load -pin_load 0.0334 [get_ports {chanx_right_out[6]}]
set_load -pin_load 0.0334 [get_ports {chanx_right_out[5]}]
set_load -pin_load 0.0334 [get_ports {chanx_right_out[4]}]
set_load -pin_load 0.0334 [get_ports {chanx_right_out[3]}]
set_load -pin_load 0.0334 [get_ports {chanx_right_out[2]}]
set_load -pin_load 0.0334 [get_ports {chanx_right_out[1]}]
set_load -pin_load 0.0334 [get_ports {chanx_right_out[0]}]
set_load -pin_load 0.0334 [get_ports {chany_bottom_out[19]}]
set_load -pin_load 0.0334 [get_ports {chany_bottom_out[18]}]
set_load -pin_load 0.0334 [get_ports {chany_bottom_out[17]}]
set_load -pin_load 0.0334 [get_ports {chany_bottom_out[16]}]
set_load -pin_load 0.0334 [get_ports {chany_bottom_out[15]}]
set_load -pin_load 0.0334 [get_ports {chany_bottom_out[14]}]
set_load -pin_load 0.0334 [get_ports {chany_bottom_out[13]}]
set_load -pin_load 0.0334 [get_ports {chany_bottom_out[12]}]
set_load -pin_load 0.0334 [get_ports {chany_bottom_out[11]}]
set_load -pin_load 0.0334 [get_ports {chany_bottom_out[10]}]
set_load -pin_load 0.0334 [get_ports {chany_bottom_out[9]}]
set_load -pin_load 0.0334 [get_ports {chany_bottom_out[8]}]
set_load -pin_load 0.0334 [get_ports {chany_bottom_out[7]}]
set_load -pin_load 0.0334 [get_ports {chany_bottom_out[6]}]
set_load -pin_load 0.0334 [get_ports {chany_bottom_out[5]}]
set_load -pin_load 0.0334 [get_ports {chany_bottom_out[4]}]
set_load -pin_load 0.0334 [get_ports {chany_bottom_out[3]}]
set_load -pin_load 0.0334 [get_ports {chany_bottom_out[2]}]
set_load -pin_load 0.0334 [get_ports {chany_bottom_out[1]}]
set_load -pin_load 0.0334 [get_ports {chany_bottom_out[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SC_IN_BOT}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {bottom_left_grid_pin_42_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {bottom_left_grid_pin_43_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {bottom_left_grid_pin_44_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {bottom_left_grid_pin_45_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {bottom_left_grid_pin_46_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {bottom_left_grid_pin_47_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {bottom_left_grid_pin_48_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {bottom_left_grid_pin_49_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ccff_head}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {left_bottom_grid_pin_34_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {left_bottom_grid_pin_35_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {left_bottom_grid_pin_36_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {left_bottom_grid_pin_37_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {left_bottom_grid_pin_38_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {left_bottom_grid_pin_39_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {left_bottom_grid_pin_40_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {left_bottom_grid_pin_41_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {left_top_grid_pin_1_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {prog_clk_0_S_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {right_bottom_grid_pin_34_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {right_bottom_grid_pin_35_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {right_bottom_grid_pin_36_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {right_bottom_grid_pin_37_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {right_bottom_grid_pin_38_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {right_bottom_grid_pin_39_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {right_bottom_grid_pin_40_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {right_bottom_grid_pin_41_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {right_top_grid_pin_1_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_right_in[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_right_in[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_right_in[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_right_in[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_right_in[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_right_in[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_right_in[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_right_in[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_right_in[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_right_in[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_right_in[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_right_in[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_right_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_right_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_right_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_right_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_right_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_right_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_right_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_right_in[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_bottom_in[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_bottom_in[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_bottom_in[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_bottom_in[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_bottom_in[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_bottom_in[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_bottom_in[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_bottom_in[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_bottom_in[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_bottom_in[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_bottom_in[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_bottom_in[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_bottom_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_bottom_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_bottom_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_bottom_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_bottom_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_bottom_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_bottom_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_bottom_in[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
