###############################################################################
# Created by write_sdc
# Sun Jun 26 11:25:37 2022
###############################################################################
current_design sb_2__0_
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name prog_clk_0_N_in -period 10.0000 [get_ports {prog_clk_0_N_in}]
set_clock_transition 0.1500 [get_clocks {prog_clk_0_N_in}]
set_clock_uncertainty 0.2500 prog_clk_0_N_in
set_propagated_clock [get_clocks {prog_clk_0_N_in}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {ccff_head}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_in[0]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_in[10]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_in[11]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_in[12]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_in[13]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_in[14]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_in[15]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_in[16]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_in[17]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_in[18]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_in[19]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_in[1]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_in[2]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_in[3]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_in[4]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_in[5]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_in[6]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_in[7]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_in[8]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_in[9]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_in[0]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_in[10]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_in[11]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_in[12]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_in[13]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_in[14]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_in[15]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_in[16]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_in[17]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_in[18]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_in[19]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_in[1]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_in[2]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_in[3]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_in[4]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_in[5]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_in[6]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_in[7]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_in[8]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_in[9]}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {left_bottom_grid_pin_11_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {left_bottom_grid_pin_13_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {left_bottom_grid_pin_15_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {left_bottom_grid_pin_17_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {left_bottom_grid_pin_1_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {left_bottom_grid_pin_3_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {left_bottom_grid_pin_5_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {left_bottom_grid_pin_7_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {left_bottom_grid_pin_9_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_left_grid_pin_42_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_left_grid_pin_43_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_left_grid_pin_44_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_left_grid_pin_45_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_left_grid_pin_46_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_left_grid_pin_47_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_left_grid_pin_48_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_left_grid_pin_49_}]
set_input_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {top_right_grid_pin_1_}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {ccff_tail}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_out[0]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_out[10]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_out[11]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_out[12]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_out[13]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_out[14]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_out[15]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_out[16]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_out[17]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_out[18]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_out[19]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_out[1]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_out[2]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_out[3]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_out[4]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_out[5]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_out[6]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_out[7]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_out[8]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chanx_left_out[9]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_out[0]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_out[10]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_out[11]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_out[12]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_out[13]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_out[14]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_out[15]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_out[16]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_out[17]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_out[18]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_out[19]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_out[1]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_out[2]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_out[3]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_out[4]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_out[5]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_out[6]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_out[7]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_out[8]}]
set_output_delay 2.0000 -clock [get_clocks {prog_clk_0_N_in}] -add_delay [get_ports {chany_top_out[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {ccff_tail}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[19]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[18]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[17]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[16]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[15]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[14]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[13]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[12]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[11]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[10]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[9]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[8]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[7]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[6]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[5]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[4]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[3]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[2]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[1]}]
set_load -pin_load 0.0334 [get_ports {chanx_left_out[0]}]
set_load -pin_load 0.0334 [get_ports {chany_top_out[19]}]
set_load -pin_load 0.0334 [get_ports {chany_top_out[18]}]
set_load -pin_load 0.0334 [get_ports {chany_top_out[17]}]
set_load -pin_load 0.0334 [get_ports {chany_top_out[16]}]
set_load -pin_load 0.0334 [get_ports {chany_top_out[15]}]
set_load -pin_load 0.0334 [get_ports {chany_top_out[14]}]
set_load -pin_load 0.0334 [get_ports {chany_top_out[13]}]
set_load -pin_load 0.0334 [get_ports {chany_top_out[12]}]
set_load -pin_load 0.0334 [get_ports {chany_top_out[11]}]
set_load -pin_load 0.0334 [get_ports {chany_top_out[10]}]
set_load -pin_load 0.0334 [get_ports {chany_top_out[9]}]
set_load -pin_load 0.0334 [get_ports {chany_top_out[8]}]
set_load -pin_load 0.0334 [get_ports {chany_top_out[7]}]
set_load -pin_load 0.0334 [get_ports {chany_top_out[6]}]
set_load -pin_load 0.0334 [get_ports {chany_top_out[5]}]
set_load -pin_load 0.0334 [get_ports {chany_top_out[4]}]
set_load -pin_load 0.0334 [get_ports {chany_top_out[3]}]
set_load -pin_load 0.0334 [get_ports {chany_top_out[2]}]
set_load -pin_load 0.0334 [get_ports {chany_top_out[1]}]
set_load -pin_load 0.0334 [get_ports {chany_top_out[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ccff_head}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {left_bottom_grid_pin_11_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {left_bottom_grid_pin_13_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {left_bottom_grid_pin_15_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {left_bottom_grid_pin_17_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {left_bottom_grid_pin_1_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {left_bottom_grid_pin_3_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {left_bottom_grid_pin_5_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {left_bottom_grid_pin_7_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {left_bottom_grid_pin_9_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {prog_clk_0_N_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {top_left_grid_pin_42_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {top_left_grid_pin_43_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {top_left_grid_pin_44_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {top_left_grid_pin_45_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {top_left_grid_pin_46_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {top_left_grid_pin_47_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {top_left_grid_pin_48_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {top_left_grid_pin_49_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {top_right_grid_pin_1_}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chanx_left_in[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_top_in[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_top_in[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_top_in[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_top_in[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_top_in[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_top_in[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_top_in[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_top_in[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_top_in[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_top_in[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_top_in[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_top_in[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_top_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_top_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_top_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_top_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_top_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_top_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_top_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chany_top_in[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
